Repository: sedounet/dotlyn-apps
Catalog: apps/github_notes/lib/l10n/app_*.arb
Languages: fr

source: Add Note
fr: Ajouter une Note

source: Edit Note
fr: Modifier la Note

source: Delete Note
fr: Supprimer la Note

source: Save
fr: Enregistrer

source: Cancel
fr: Annuler

source: Sync
fr: Synchroniser

source: Settings
fr: Paramètres

source: Title
fr: Titre

source: Content
fr: Contenu

# conflictDialogTitle
source: Conflict detected
fr: Conflit détecté

# conflictDialogDescription
source: A conflict was detected between your local file and GitHub.
fr: Un conflit a été détecté entre votre fichier local et GitHub.

# conflictFileExistsHeader
source: This file already exists on GitHub. What would you like to do?
fr: Ce fichier existe déjà sur GitHub. Que souhaitez-vous faire ?

# conflictBothModifiedHeader
source: Changes have been made both locally and on GitHub. How would you like to resolve this conflict?
fr: Des modifications ont été apportées à la fois localement et sur GitHub. Que souhaitez-vous faire pour résoudre ce conflit ?

# conflictGenericHeader
source: A conflict was detected. Please choose how to proceed.
fr: Un conflit a été détecté. Veuillez choisir comment procéder.

# conflictFetchRemote
source: Fetch remote
fr: Importer depuis GitHub

# conflictOverwriteRemote
source: Overwrite GitHub
fr: Écraser sur GitHub

# cannotDuplicateLinkedFile
source: Cannot duplicate file linked to GitHub
fr: Impossible de dupliquer un fichier lié à GitHub

# cannotDuplicateLinkedFileReason
source: This file is already synced with GitHub. You can only have one local instance per GitHub file. Consider creating a new file instead.
fr: Ce fichier est déjà synchronisé avec GitHub. Vous ne pouvez avoir qu'une seule instance locale par fichier GitHub. Envisagez de créer un nouveau fichier à la place.

# copilotTest
source: Copilot test string (en)
fr: Chaîne de test Copilot (fr)

# tokenSaved
source: GitHub token saved (secure) — {count} chars
fr: Jeton GitHub enregistré (sécurisé) — {count} caractères

# errorSavingToken
source: Error saving token: {error}
fr: Erreur lors de la sauvegarde du token : {error}

# themeSet
source: Theme set to {mode}
fr: Thème défini sur {mode}

# languageSet
source: Language set to {lang} (no translations yet)
fr: Langue définie sur {lang} (pas encore de traductions)

# tokenValid
source: Token is valid!
fr: Le token est valide !

# tokenInvalid
source: Token is invalid
fr: Le token est invalide

# addFileTitle
source: Add File to Track
fr: Ajouter un fichier à suivre

# ownerLabel
source: Owner
fr: Propriétaire

# ownerHint
source: e.g., johndoe or my-org
fr: ex: johndoe ou my-org

# repoLabel
source: Repository
fr: Dépôt

# repoHint
source: e.g., myapp
fr: ex: myapp

# pathLabel
source: File Path
fr: Chemin du fichier

# pathHint
source: e.g., README.md or _docs/apps/myapp/PROMPT_USER.md
fr: ex: README.md ou _docs/apps/myapp/PROMPT_USER.md

# nicknameLabel
source: Nickname
fr: Surnom

# nicknameHint
source: e.g., MyApp - User Prompt
fr: ex: MyApp - Prompt utilisateur

# allFieldsRequired
source: All fields are required
fr: Tous les champs sont obligatoires

# duplicateTrackedPath
source: This GitHub path ({owner}/{repo}/{path}) is already tracked. Change the path or filename to create a duplicate.
fr: Ce chemin GitHub ({owner}/{repo}/{path}) est déjà suivi. Changez le chemin ou le nom du fichier pour créer un doublon.

# fileImported
source: File imported from GitHub
fr: Fichier importé depuis GitHub

# fileAddedLocal
source: File added (local only)
fr: Fichier ajouté (local)

# invalidTokenPleaseUpdate
source: Invalid GitHub token. Please update it in Settings.
fr: Token GitHub invalide. Veuillez le mettre à jour dans les paramètres.

# githubError
source: GitHub error ({code}). Please try again later.
fr: Erreur GitHub ({code}). Veuillez réessayer plus tard.

# noNetworkFileAdded
source: No network: file added locally. It will sync when online.
fr: Pas de réseau : fichier ajouté localement. Il sera synchronisé quand en ligne.

# errorCheckingGitHub
source: Error checking GitHub: {error}
fr: Erreur lors de la vérification GitHub : {error}

source: File added successfully
fr: Fichier ajouté avec succès

source: Add
fr: Ajouter

# editFileTitle
source: Edit File Settings
fr: Modifier les paramètres du fichier

source: No files configured
fr: Aucun fichier configuré

# goToSettings
source: Go to Settings to add files
fr: Aller dans Paramètres pour ajouter des fichiers

source: Open Settings
fr: Ouvrir les paramètres

# errorMessage
source: Error: {error}
fr: Erreur : {error}

# ownerRequired
source: Please enter owner
fr: Veuillez saisir le propriétaire

# repoRequired
source: Please enter repository
fr: Veuillez saisir le dépôt

# pathRequired
source: Please enter file path
fr: Veuillez saisir le chemin du fichier

# nicknameRequired
source: Please enter a nickname
fr: Veuillez saisir un surnom

source: Duplicate
fr: Dupliquer

# settingsTitle
source: Settings
fr: Paramètres

source: Test Token
fr: Tester le token

source: Save Token
fr: Enregistrer le token

# debugTokenTitle
source: Debug: GitHub token
fr: Debug : token GitHub

source: Close
fr: Fermer

source: Copy
fr: Copier

source: Show token (debug)
fr: Afficher le token (debug)

# themeTitle
source: Theme
fr: Thème

# themeSystem
source: System
fr: Système

# themeLight
source: Light
fr: Clair

# themeDark
source: Dark
fr: Sombre

# languageTitle
source: Language
fr: Langue

# languageSystem
source: System
fr: Système

# languageSystemDevice
source: System (device)
fr: Système (appareil)

# deleteFileTitle
source: Delete File?
fr: Supprimer le fichier ?

# deleteFileContent
source: Remove "{nickname}" from tracked files?
fr: Supprimer "{nickname}" des fichiers suivis ?

source: Delete
fr: Supprimer

source: Just now
fr: À l'instant
